[
    {
        "course_code": "BIOL 112",
        "course_title": "Biology of the Cell",
        "description": "The principles of cellular and molecular biology using bacterial and eukaryotic examples. [3-0-0] Prerequisite: One of CHEM 12, CHEM 100, CHEM 110, CHEM 111 and one of BIOL 11, BIOL 12, BIOL 111.",
        "prerequisites": [
            "CHEM 100",
            "CHEM 111",
            "BIOL 111"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "BIOT 280",
        "course_title": "Introductory Biotechnology",
        "description": "Block registration for the biotechnology, microbiology, physiology, communication for biotechnology, organic chemistry, information technology, plant anatomy, plant physiology and cell biology courses taken in the Joint BCIT/UBC Degree in Biotechnology.  Credit limited to students in the Joint Degree Program.",
        "prerequisites": [],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "CHEM 100",
        "course_title": "Foundations of Chemistry",
        "description": "Atomic and molecular properties, chemical reactions, bonding, nomenclature, kinetics, equilibrium processes, acids and bases, oxidation and reduction.  Intended for students who do not receive a satisfactory score on the UBC Chemistry Basic Skills Test, and need to establish a foundation of chemistry skills before proceeding to other first year chemistry courses. This course is not eligible for Credit/D/Fail grading. [3-0-1] Prerequisite: Not open to students with credit for Chemistry 12.  Permission of the department head.",
        "prerequisites": [],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "CHEM 111",
        "course_title": "Structure, Bonding, and Equilibrium in Chemistry",
        "description": "Fundamentals of bonding theories, structural chemistry and equilibrium with applications relevant to modern society. [3-3-1] Prerequisite: Not open to students with credit for CHEM 12. A satisfactory score on the UBC Chemistry Basic Skills Test.",
        "prerequisites": [],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "BIOL 111",
        "course_title": "Introduction to Modern Biology",
        "description": "Concepts fundamental to biological issues, such as the genetic basis of biological variation, evolution, infectious diseases, causes of cancer, population growth, and human effects on ecosystems.  Not open to students who have credit for Biology 12 (including AP, IB). [3-0-0]",
        "prerequisites": [],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "MICB 211",
        "course_title": "Foundations of Microbiology",
        "description": "Prokaryotic diversity and the impact and applications of microbial metabolic, genetic, and growth processes in environmental contexts. Bacteria-human interactions in health and disease, mode of action of antibiotics and antibiotic resistance, virulence factors of bacteria, and host response to infection. [3-0-1] Prerequisite: Either (a) all of BIOL 112, CHEM 121 or (b) one of BIOL 200, BMEG 245, SCIE 001.",
        "prerequisites": [
            "BIOL 112",
            "CHEM 121",
            "BIOL 200"
        ],
        "corequisites": [],
        "themes": [
            "Microbiology",
            "Environmental Microbiology",
            "Human Health"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "CHEM 123",
        "course_title": "Thermodynamics, Kinetics and Organic Chemistry",
        "description": "Fundamentals of chemical reactivity: thermodynamics; kinetics; organic chemistry, including stereochemistry; applications relevant to modern society. [3-3-0] Prerequisite: One of CHEM 111, CHEM 121, CHEM 141.",
        "prerequisites": [
            "CHEM 111",
            "CHEM 121"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "CHEM 121",
        "course_title": "Structure and Bonding in Chemistry",
        "description": "Fundamentals of bonding theories and structural chemistry, with applications relevant to modern society. [3-3-0] Prerequisite: One of CHEM 12, CHEM 100. Equivalency: CHEM141",
        "prerequisites": [
            "CHEM 100"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "BIOL 200",
        "course_title": "Fundamentals of Cell Biology",
        "description": "Structure and function of plant and animal cells; membrane models, cytoplasmic organelles, biological information from gene to protein, the endomembrane system, secretion, intracellular digestion, endocytosis, transport processes, cytoskeleton and cell motility. [3-0-1] Prerequisite: Either (a) BIOL 112 and one of CHEM 123, CHEM 130;  or (b) SCIE 001. or (c) 8 transfer credits of first-year BIOL and 6 credits of first-year CHEM or (d) one of BIOL 112 or BIOL 121 and a corequisite of one of CHEM 203 or CHEM 223.",
        "prerequisites": [
            "BIOL 112",
            "CHEM 123"
        ],
        "corequisites": [
            "CHEM 203"
        ],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "MICB 212",
        "course_title": "Introductory Immunology & Virology",
        "description": "Innate and adaptive immune responses to bacterial and viral pathogens, autoimmunity, allergies and graft rejection; virus structure, replication cycles, pathogenesis and vaccines; data analysis of foundational immunology and virology experiments. [3-0-1] Prerequisite: One of BIOL 112, BIOL 200, BMEG 245, SCIE 001.",
        "prerequisites": [
            "BIOL 112",
            "BIOL 200"
        ],
        "corequisites": [],
        "themes": [
            "Virology",
            "Immunology",
            "Human Health"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "BIOL 201",
        "course_title": "Introduction to Biochemistry",
        "description": "Biological molecules, protein structure and enzyme action, energy transfer, central metabolic pathways and their regulation. Examples drawn from plants, animals and microorganisms. (Consult the Credit Exclusion list within the Faculty of Science section of the Calendar.) Credit will be granted for only one of BIOL 201, BIOC 202, or BIOC 203. [3-0-1] Prerequisite: BIOL 200 and one of CHEM 233, CHEM 260. ; or BIOL 200 and a corequisite of CHEM 213; or a corequisite of either CHEM 313 or CHEM 330.",
        "prerequisites": [
            "BIOL 200",
            "CHEM 233"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "BIOC 203",
        "course_title": "Fundamentals of Biochemistry",
        "description": "Amino acids and proteins. Enzymes and enzymology. Human metabolic pathways. Structure, function and metabolism of carbohydrates including glycogen storage and gluconeogenesis. Restricted to students in Biochemistry specializations. Credit will be granted for only one of BIOC 202, BIOC 203 or BIOL 201. [3-0-1] Prerequisite: BIOL 200 and one of CHEM 203, CHEM 223. Corequisite: CHEM 213.",
        "prerequisites": [
            "BIOL 200",
            "CHEM 203"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "BIOC 202",
        "course_title": "Introductory Medical Biochemistry",
        "description": "Introduction to proteins and enzymes, carbohydrate metabolism, and glucose homeostasis. The course emphasis is on human biochemistry and it is designed for students going into health science fields. Credit will be granted for only one of BIOC 202, BIOC 203 or BIOL 201. [3-0-0] Prerequisite: One of CHEM 203, CHEM 223, CHEM 233.",
        "prerequisites": [
            "CHEM 203",
            "CHEM 233"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "BIOT 380",
        "course_title": "Advanced Biotechnology",
        "description": "Block registration for the microbiology, molecular genetics, biochemistry, management and regulatory affairs, process systems, analytical chemistry and communication courses taken in the BCIT/UBC Joint Degree in Biotechnology.  Credit limited to students in the Joint Degree Program.",
        "prerequisites": [],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "MICB 301",
        "course_title": "Microbial Ecophysiology",
        "description": "Dynamics and control of prokaryotic cellular processes in response to the biotic and abiotic environment including metabolic interactions and metabolic cooperation between microorganisms. [3-0-1] Prerequisite: Either (a) one of MICB 211, MICB 201 and one of BIOL 201, BIOC 202, BIOC 203;  or (b) BIOT 380.",
        "prerequisites": [
            "MICB 211",
            "BIOL 201",
            "BIOC 202",
            "BIOC 203",
            "BIOT 380"
        ],
        "corequisites": [],
        "themes": [
            "Microbiology",
            "Environmental Microbiology"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "CHEM 203",
        "course_title": "Introduction to Organic Chemistry",
        "description": "Structure, bonding and physical properties of aliphatic and aromatic compounds; mechanistic analysis of chemical reactivity of common functional groups with a focus on carbon-heteroatom bond formation; functional group interconversion and oxidation/reduction reactions. Only open to students in Chemistry or Biochemistry specializations. Credit will be granted for only one of CHEM 203 or CHEM 223, CHEM 225 or CHEM 233, 235. [3-3-0] Prerequisite: Either (a) CHEM 123 or (b) all of CHEM 130, CHEM 135 or (c) SCIE 001.",
        "prerequisites": [
            "CHEM 123"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "CHEM 233",
        "course_title": "Organic Chemistry for the Biological Sciences",
        "description": "Reactions and properties of carbonyl compounds, carbohydrates, amino acids, nucleic acids. Credit will be granted for only one of CHEM 233 or CHEM 203 or CHEM 223. [3-0-0] Prerequisite: One of CHEM 123, CHEM 130, SCIE 001.",
        "prerequisites": [
            "CHEM 123"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "MICB 302",
        "course_title": "Immunology",
        "description": "Mechanisms of innate and adaptive immune responses.  Hematopoiesis, development of T and B lymphocytes, leukocyte migration, antigen processing/presentation and the major histocompatibility complex, immune responses against pathogens, and diseases associated with aberrant immune responses. [3-0-1] Prerequisite: One of MICB 212, MICB 202.",
        "prerequisites": [
            "MICB 212"
        ],
        "corequisites": [],
        "themes": [
            "Immunology",
            "Human Health"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 305",
        "course_title": "Data Science in Microbiology and Immunology Research",
        "description": "A team-based data science research experience in microbiology and immunology. [3-0-1] Prerequisite: MICB_V 205 and 3rd-year class standing. MICB 305 replaces MICB 475 effective 2026W.",
        "prerequisites": [
            "MICB 205"
        ],
        "corequisites": [],
        "themes": [
            "Data Science",
            "Environmental Microbiology"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 306",
        "course_title": "Molecular Virology",
        "description": "Introduction to virus structure and replication. Detailed examination of selected viruses including polio, HIV and cancer-causing retroviruses. Development of vaccines and anti-viral drugs, the use of virus vectors to cure genetic diseases. [3-0-1] Prerequisite: One of MICB 212, MICB 202, BIOT 380.",
        "prerequisites": [
            "MICB 212",
            "BIOT 380"
        ],
        "corequisites": [],
        "themes": [
            "Virology",
            "Human Health"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 322",
        "course_title": "Molecular Microbiology Laboratory",
        "description": "Aseptic handling and characterization of microbes, growth properties, enzyme assays, protein analysis and plasmid isolation. Restricted to students in Microbiology and Immunology specializations. [2-4-0] Prerequisites:  MICB 211 (or 201).Co-requisites:  All of BIOL 200, BIOL 201 (or BIOC 202 or 203), CHEM 233, and MICB 212 (or 202).",
        "prerequisites": [
            "MICB 211"
        ],
        "corequisites": [
            "BIOL 200",
            "BIOL 201",
            "BIOC 202",
            "BIOC 203",
            "CHEM 233",
            "MICB 212"
        ],
        "themes": [
            "Microbiology",
            "Environmental Microbiology"
        ],
        "class_type": "Lab"
    },
    {
        "course_code": "MICB 398",
        "course_title": "Co-operative Work Placement I",
        "description": "Work experience.  Restricted to students admitted to the Co-operative Education Program in the Biotechnology or Microbiology and Immunology specializations. Pass/Fail This course is not eligible for Credit/D/Fail grading. Prerequisite: Either (a) one of MICB 211, MICB 201 and one of MICB 212, MICB 202;  or (b) BIOT 380.",
        "prerequisites": [
            "MICB 211",
            "MICB 212",
            "BIOT 380"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "MICB 399",
        "course_title": "Co-operative Work Placement II",
        "description": "Work experience.  Restricted to students admitted to the Co-operative Education Program in the Biotechnology or Microbiology and Immunology specializations. Pass/Fail This course is not eligible for Credit/D/Fail grading. Prerequisite: MICB 398.",
        "prerequisites": [
            "MICB 398"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "MICB 402",
        "course_title": "Advanced Immunology",
        "description": "Molecular basis of lymphocyte development, activation and adhesion; immunogenetics and the major histocompatibility complex. Consult the credit exclusion list within the Faculty of Science section of the calendar. [3-0-1] Prerequisite: One of MICB 302, BIOT 380. If MICB 302 is used as the prerequisite for MICB 402, students are required to take one of the following as a corequisite: BIOL 234, BIOL 335, MICB 325.",
        "prerequisites": [
            "MICB 302",
            "BIOT 380"
        ],
        "corequisites": [],
        "themes": [
            "Immunology",
            "Human Health"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "BIOC 303",
        "course_title": "Molecular Biochemistry",
        "description": "Structure, function and metabolism of lipids, steroids, amino acids and nucleotides; the biochemistry and molecular biology of replication, transcription, translation and gene regulation. For students in Biochemistry and Honours programs in other life sciences.  Credit will be granted for only one of BIOC 302 or BIOC 303. [3-0-0] Prerequisite: One of BIOC 203, BIOC 202, BIOL 201 and either (a) CHEM 213 or (b) CHEM 233.",
        "prerequisites": [
            "BIOC 203",
            "BIOC 202",
            "BIOL 201",
            "CHEM 233"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "MICB 325",
        "course_title": "Analysis of Microbial Genes and Genomes",
        "description": "Genetic, molecular biological and bioinformatic approaches for the analysis of microbial genomes, gene structure-function and gene expression with emphasis on bacteria. [3-0-0] Prerequisite: One of MICB 211, MICB 201, BIOL 234.",
        "prerequisites": [
            "MICB 211",
            "BIOL 234"
        ],
        "corequisites": [],
        "themes": [
            "Data Science",
            "Microbiology"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "BIOL 234",
        "course_title": "Fundamentals of Genetics",
        "description": "Genotype and phenotype, mechanisms of inheritance, genetic analysis. Please consult the Faculty of Science Credit Exclusion Lists: https://vancouver.calendar.ubc.ca/faculties-colleges-and-schools/faculty-science/bachelor-science/credit-exclusion-lists. [3-0-2] Prerequisite: Either (a) all of BIOL 112, BIOL 121 or (b) SCIE 001 ; (c) a corequisite of one of CHEM 203 or CHEM 223 and one of BIOL 112 or BIOL 121; or (d) 8 transfer credits of first-year BIOL.",
        "prerequisites": [
            "BIOL 112",
            "BIOL 121",
            "CHEM 203",
            "BIOL 112",
            "BIOL 121"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "BIOL 121",
        "course_title": "Genetics, Evolution and Ecology",
        "description": "Principles of storage and transmission of genetic variation; origin and evolution of species and their ecological interactions. Credit will be granted for only one of BIOL 121 or BIOL 344. [3-0-0] Prerequisite: One of BIOL 11, BIOL 12, BIOL 111.",
        "prerequisites": [
            "BIOL 111"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "BIOC 302",
        "course_title": "General Biochemistry",
        "description": "Metabolic reactions of lipids, steroids, amino acids and nucleotides; the biochemistry of replication, transcription and translation. Credit will be granted for only one of BIOC 302 or BIOC 303. [3-0-1] Prerequisite: One of BIOL 201, BIOC 202, BIOC 203 and one of CHEM 203, CHEM 223, CHEM 233. Equivalency: BIOC 303",
        "prerequisites": [
            "BIOL 201",
            "BIOC 202",
            "BIOC 203",
            "CHEM 203",
            "CHEM 233"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "BIOL 335",
        "course_title": "Molecular Genetics",
        "description": "Isolation and identification of genes, analysis of gene structure; gene expression and its regulation in prokaryotes and in eukaryotes; developmental genetics. [3-0-2] Prerequisite: One of BIOL 233, BIOL 234, MICB 322, FRST 302.",
        "prerequisites": [
            "BIOL 234",
            "MICB 322"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "MICB 405",
        "course_title": "Bioinformatics",
        "description": "Computational methods to analyze genome and protein sequences to derive structural and functional information. Related topics in functional genomics. [3-0-1] Prerequisite: One of MICB 301, MICB 325, BIOC 302, BIOC 303, BIOL 335, BIOT 380.",
        "prerequisites": [
            "MICB 301",
            "MICB 325",
            "BIOC 302",
            "BIOC 303",
            "BIOL 335",
            "BIOT 380"
        ],
        "corequisites": [],
        "themes": [
            "Data Science"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 407",
        "course_title": "Viral Infections in Humans.",
        "description": "Interactions between viruses and humans; pathogenesis; persistence and viral oncogenesis; virological diagnosis and treatment. (Consult the Credit Exclusion list within the Faculty of Science section of the Calendar.) [3-0-0] Prerequisite: MICB306",
        "prerequisites": [
            "MICB 306"
        ],
        "corequisites": [],
        "themes": [
            "Virology",
            "Human Health"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 430",
        "course_title": "Seminar in Microbiological Literature",
        "description": "Student seminars on selected papers from the microbiological literature. Compulsory for Honours students. Major students may enrol with permission of the department head.\n The credit value for this course will be determined in consultation with the student prior to the registration",
        "prerequisites": [],
        "corequisites": [],
        "themes": [
            "Microbiology",
            "Virology",
            "Immunology",
            "Human Health"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 323",
        "course_title": "Molecular Immunology and Virology Laboratory",
        "description": "Genetic manipulations of bacteria, introductory immunological and virological procedures, tissue culture. Restricted to students in Microbiology and Immunology specializations. [2-4-0] Prerequisite: [MICB322]",
        "prerequisites": [
            "MICB 322"
        ],
        "corequisites": [],
        "themes": [
            "Immunology"
        ],
        "class_type": "Lab"
    },
    {
        "course_code": "MICB 448",
        "course_title": "Directed Research",
        "description": "A library (3 credits) or laboratory (3 or 6 credits) project. Requires permission of the Undergraduate Advisor. The results are presented in a written report to be reviewed by oral examination. Prerequisite: Either (a) MICB 323 or (b) all of MICB 322, MICB 399.\n The credit value for this course will be determined in consultation with the student prior to the registration",
        "prerequisites": [
            "MICB 323",
            "MICB 322",
            "MICB 399"
        ],
        "corequisites": [],
        "themes": [
            "Data Science",
            "Microbiology",
            "Virology",
            "Immunology",
            "Environmental Microbiology",
            "Human Health"
        ],
        "class_type": "Lab"
    },
    {
        "course_code": "MICB 449",
        "course_title": "Research Problem",
        "description": "A laboratory investigation in the final year of the Honours program. The results are presented in a written report, to be reviewed by oral examination. Prerequisite: Either (a) MICB 323 or (b) all of MICB 322, MICB 399.",
        "prerequisites": [
            "MICB 323",
            "MICB 322",
            "MICB 399"
        ],
        "corequisites": [],
        "themes": [
            "Data Science",
            "Microbiology",
            "Virology",
            "Immunology",
            "Environmental Microbiology",
            "Human Health"
        ],
        "class_type": "Lab"
    },
    {
        "course_code": "MICB 471",
        "course_title": "Laboratory Research in Microbiology and Immunology",
        "description": "A team-based laboratory research experience in microbiology and immunology. [2-4-0] Prerequisite: One of MICB 323, BIOT 380.",
        "prerequisites": [
            "MICB 323",
            "BIOT 380"
        ],
        "corequisites": [],
        "themes": [
            "Data Science",
            "Microbiology",
            "Environmental Microbiology",
            "Human Health",
            "Virology",
            "Immunology"
        ],
        "class_type": "Lab"
    },
    {
        "course_code": "MICB 498",
        "course_title": "Co-operative Work Placement III",
        "description": "Work experience.  Restricted to students admitted to the Co-operative Education Program in the Biotechnology or Microbiology and Immunology specializations. Pass/Fail This course is not eligible for Credit/D/Fail grading. Prerequisite: Either (a) MICB 399 or (b) BIOT 380. and completion of two co-op work terms.",
        "prerequisites": [
            "MICB 399",
            "BIOT 380"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "MICB 499",
        "course_title": "Co-operative Work Placement IV",
        "description": "Work experience in an industrial research setting, taken during the Winter Session (Term 1) of fifth year. Restricted to students admitted to the Co-operative Education Program in the Biotechnology or Microbiology and Immunology specializations. Pass/Fail This course is not eligible for Credit/D/Fail grading. Prerequisite: MICB 498.",
        "prerequisites": [
            "MICB 498"
        ],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "DSCI 100",
        "course_title": "Introduction to Data Science",
        "description": "Use of data science tools to summarize, visualize, and analyze data. Sensible workflows and clear interpretations are emphasized. [3-0-1] Prerequisite: MATH 12",
        "prerequisites": [],
        "corequisites": [],
        "themes": [],
        "class_type": null
    },
    {
        "course_code": "MICB 205",
        "course_title": "Fundamental Data Science in Microbiology and Immunology",
        "description": "Foundations in data science course that incorporates the use of biological data science tools to perform survey-level analysis of microbiology and immunology datasets. [3-0-0] Prerequisite: DSCI 100.",
        "prerequisites": [
            "DSCI 100"
        ],
        "corequisites": [],
        "themes": [
            "Data Science",
            "Microbiology",
            "Virology",
            "Immunology"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 308",
        "course_title": "Paradigms in Bacterial Pathogenesis",
        "description": "Mechanisms of bacterial pathogenesis including adherence, invasion, intracellular survival, toxins, host defenses and microbial evasion strategies, antibiotics, and vaccines.  Introduction to experimental approaches used to study bacterial pathogens. [3-0-0] Prerequisite: Either (a) one of MICB 211, MICB 202 and one of BIOL 201, BIOC 202, BIOC 203;  or (b) BIOT 380.",
        "prerequisites": [
            "MICB 211",
            "BIOL 201",
            "BIOC 202",
            "BIOC 203",
            "BIOT 380"
        ],
        "corequisites": [],
        "themes": [
            "Microbiology",
            "Human Health"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 404",
        "course_title": "Topics in Molecular Bacterial Pathogenesis",
        "description": "A lecture/discussion/library research course. Topics such as antibiotic resistance, pathogen genomics; host-pathogen interactions; evolution of pathogens; host responses to infection, invasive mechanisms, resistance mechanisms. [1-0-4] Prerequisite: MICB 302 and one of MICB 308, MICB 408.",
        "prerequisites": [
            "MICB 302",
            "MICB 308",
            "MICB 408"
        ],
        "corequisites": [],
        "themes": [
            "Microbiology",
            "Human Health"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 408",
        "course_title": "Advanced Bacterial Pathogenesis",
        "description": "Current and emerging themes in bacterial pathogenesis including cellular microbiology, bacterial cell biology processes and their role in virulence including secretion systems to deliver virulence factors and immune evasion strategies employed by pathogens.  Development of antibiotics and resistance to antibiotics. [3-0-0] Prerequisite: MICB 308.",
        "prerequisites": [
            "MICB 308"
        ],
        "corequisites": [],
        "themes": [
            "Microbiology",
            "Human Health"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 406",
        "course_title": "Topics in Molecular Virology",
        "description": "Presentations, library research, paper reviews, class discussions about current research in virology. Topics such as molecular targets in viral therapy; chronic viral infection; virus-host cell interaction. [1-0-4] Prerequisite: MICB 306.",
        "prerequisites": [
            "MICB 306"
        ],
        "corequisites": [],
        "themes": [
            "Virology",
            "Human Health"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 412",
        "course_title": "Topics in Immunological Research",
        "description": "Presentations, library research, paper reviews and class discussion on selected areas of advanced molecular and cellular immunological research. [1-0-4] Prerequisite: [MICB302] AND [MICB402, MEDG410]",
        "prerequisites": [
            "MICB 302"
        ],
        "corequisites": [],
        "themes": [
            "Immunology",
            "Human Health"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 413",
        "course_title": "Topics in Microbiome Research",
        "description": "Critical examination and discussion of contemporary research literature concerning the impact of host-associated microbiomes on host development, health and disease with a focus on humans.  Priority given to students in Microbiology and Immunology specializations. [3-0-0] Prerequisite: Either (a) MICB 302 and one of MICB 308, MICB 325, BIOL 335;  or (b) BIOT 380. And fourth-year standing in Science.",
        "prerequisites": [
            "MICB 302",
            "MICB 308",
            "MICB 325",
            "BIOL 335",
            "BIOT 380"
        ],
        "corequisites": [],
        "themes": [
            "Microbiology",
            "Human Health"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 418",
        "course_title": "Industrial Microbiology and Biotechnology",
        "description": "Exploitation of microbial and animal cells for the industrial production of chemicals ranging from alcohol to therapeutic proteins. Genetic manipulation of cellular characteristics, fermentation methods, patenting and governmental approval processes. [3-0-0] Corequisite: One of BIOL 335, MICB 325, BIOT 380.",
        "prerequisites": [],
        "corequisites": [
            "BIOL 335",
            "MICB 325",
            "BIOT 380"
        ],
        "themes": [
            "Microbiology"
        ],
        "class_type": "Lecture"
    },
    {
        "course_code": "MICB 425",
        "course_title": "Microbial Ecological Genomics",
        "description": "Intrinsic and extrinsic forces driving prokaryotic genome evolution.  Gene transfer; microbial species concepts; community genome structure, function and dynamics; ecological impacts of microbial genome diversity.  Emphasis on problem solving and experimental design. [3-3-0] Prerequisite: One of BIOL 335, MICB 325, BIOT 380.",
        "prerequisites": [
            "BIOL 335",
            "MICB 325",
            "BIOT 380"
        ],
        "corequisites": [],
        "themes": [
            "Data Science",
            "Microbiology",
            "Environmental Microbiology"
        ],
        "class_type": "Lecture"
    }
]